In [4]:
import pandas as pd
import numpy as np

In [5]:
# creating a dataframe
raw_data = {'Week1':[30,32,34.5, 32.1, 30.2], 
            'Week2':[32.0,31.5,30.5,32.5,30.9], 
            'Week3':[29,31.7,32.7,34.1,31.2],
            'Week4':[30.3,32.1,34.3,31.1,31.2]}

month = pd.DataFrame(raw_data,columns = ['Week1', 'Week2','Week3','Week4'])
print(month)

   Week1  Week2  Week3  Week4
0   30.0   32.0   29.0   30.3
1   32.0   31.5   31.7   32.1
2   34.5   30.5   32.7   34.3
3   32.1   32.5   34.1   31.1
4   30.2   30.9   31.2   31.2

In [6]:
print("-----------------------------------------------------")
print(month.head()) # display first five (by default)
print("------------------------------------------------------")
print(month.tail(3))
print("-----------------------------------------------------")

-----------------------------------------------------
   Week1  Week2  Week3  Week4
0   30.0   32.0   29.0   30.3
1   32.0   31.5   31.7   32.1
2   34.5   30.5   32.7   34.3
3   32.1   32.5   34.1   31.1
4   30.2   30.9   31.2   31.2
------------------------------------------------------
   Week1  Week2  Week3  Week4
2   34.5   30.5   32.7   34.3
3   32.1   32.5   34.1   31.1
4   30.2   30.9   31.2   31.2
-----------------------------------------------------

In [23]:
#Selecting columns of dataframe
print(month)
print(month.Week1.head(3)) # 1st column of df
print("-----------------------------------------------------")
print(month['Week4'].mean()) # alternative way of selecting the column
print("-----------------------------------------------------")
print(month.Week2) # whole cloumn selected 
print(month[['Week3','Week4']]) #selecting multiple columns 
print("-----------------------------------------------------")
print(month[['Week3','Week4']].mean() )
print("-----------------------------------------------------")

   Week1  Week2  Week3  Week4
0   30.0   32.0   29.0   30.3
1   32.0   31.5   31.7   32.1
2   34.5   30.5   32.7   34.3
3   32.1   32.5   34.1   31.1
4   30.2   30.9   31.2   31.2
0    30.0
1    32.0
2    34.5
Name: Week1, dtype: float64
-----------------------------------------------------
31.8
-----------------------------------------------------
0    32.0
1    31.5
2    30.5
3    32.5
4    30.9
Name: Week2, dtype: float64
   Week3  Week4
0   29.0   30.3
1   31.7   32.1
2   32.7   34.3
3   34.1   31.1
4   31.2   31.2
-----------------------------------------------------
Week3    31.74
Week4    31.80
dtype: float64
-----------------------------------------------------

In [9]:
#create a dataframe
raw_data = {'Q1':[120,200,175],
            'Q2':[80,180,175],
            'Q3':[150,150,200],
            'Q4':[100,120,130]}
quartely_sales = pd.DataFrame(raw_data, index=['Entry1','Entry2','Entry3'])
print (quartely_sales)

         Q1   Q2   Q3   Q4
Entry1  120   80  150  100
Entry2  200  180  150  120
Entry3  175  175  200  130

In [10]:
print (quartely_sales.loc['Entry1']) #selecting a single row
print(type(quartely_sales.loc['Entry1']))
print (quartely_sales.iloc[1:3]) #selecting multiple rows

Q1    120
Q2     80
Q3    150
Q4    100
Name: Entry1, dtype: int64
<class 'pandas.core.series.Series'>
         Q1   Q2   Q3   Q4
Entry2  200  180  150  120
Entry3  175  175  200  130

In [12]:
data = {
    'A': [1, 2, 3, 4, 5],
    'B': [10, 20, 30, 40, 50],
    'C': [100, 200, 300, 400, 500]
}

df = pd.DataFrame(data)

In [13]:
print(df)
print("-----------------------------------------------------")
print(df.iloc[2])  # Selects the third row
print("-----------------------------------------------------")
print(df.iloc[:, 1])  # Selects the second column
print("-----------------------------------------------------")
print(df.iloc[1:4, 0:2])  # Selects rows 1 to 3 and columns 0 to 1
print("-----------------------------------------------------")
print(df.iloc[[0, 2, 4], [0, 2]])  # Selects rows 0, 2, 4 and columns 0, 2
print("-----------------------------------------------------")

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500
-----------------------------------------------------
A      3
B     30
C    300
Name: 2, dtype: int64
-----------------------------------------------------
0    10
1    20
2    30
3    40
4    50
Name: B, dtype: int64
-----------------------------------------------------
   A   B
1  2  20
2  3  30
3  4  40
-----------------------------------------------------
   A    C
0  1  100
2  3  300
4  5  500
-----------------------------------------------------

In [14]:
#adding and removing columns 
print(quartely_sales)
quartely_sales['Aunnal_sales'] = quartely_sales['Q1']+quartely_sales['Q2']+quartely_sales['Q3']+quartely_sales['Q4']
print (quartely_sales)

         Q1   Q2   Q3   Q4
Entry1  120   80  150  100
Entry2  200  180  150  120
Entry3  175  175  200  130
         Q1   Q2   Q3   Q4  Aunnal_sales
Entry1  120   80  150  100           450
Entry2  200  180  150  120           650
Entry3  175  175  200  130           680

In [25]:
#dropping a col
s = quartely_sales.drop(['Aunnal_sales'], axis = 1, inplace = False) # inplace = false
print(quartely_sales)
print(s)

KeyError: "['Aunnal_sales'] not found in axis"

In [26]:
# removing rows 
newdf = quartely_sales.drop(['Entry2'])
print(quartely_sales)
print(newdf)

         Q1   Q2   Q3   Q4  Aunnal_sales
Entry1  120   80  150  100           450
Entry2  200  180  150  120           650
Entry3  175  175  200  130           680
         Q1   Q2   Q3   Q4  Aunnal_sales
Entry1  120   80  150  100           450
Entry3  175  175  200  130           680

In [27]:
# removing multiple rows using index range 
quartely_sales.drop(quartely_sales.index[1:3]) # deleted the row number - 1,2

         Q1  Q2   Q3   Q4  Aunnal_sales
Entry1  120  80  150  100           450

In [20]:
# udpating value from slides 
# quartely_sales.set_value('Entry1', 'Q1', 0) # error
# quartely_sales.loc['Entry1', 'Q1'] = 0
quarterly_sales.at['Entry1', 'Q1'] = 0 # alternative
print(quartely_sales)

         Q1   Q2   Q3   Q4  Aunnal_sales
Entry1    0   80  150  100           450
Entry2  200  180  150  120           650
Entry3  175  175  200  130           680

In [36]:
data = {'Name': ['Jude', 'Madan', 'Rafael', 'Edvina'],
        'Account': [1,2,3,4]}
df = pd.DataFrame(data, index = ['C1', 'C2', 'C3', 'C4'])
print(df)
data = {'Account' : [1001,2001,3001,4001]}
new_accounts = pd.DataFrame(data, index = ['C1','C2', 'C3', 'C4'])
print(new_accounts)
df.update(new_accounts)
print(df)

      Name  Account
C1    Jude        1
C2   Madan        2
C3  Rafael        3
C4  Edvina        4
    Account
C1     1001
C2     2001
C3     3001
C4     4001
      Name  Account
C1    Jude     1001
C2   Madan     2001
C3  Rafael     3001
C4  Edvina     4001

In [38]:
#filtering data:
rawData = {'custID': [1001,1003,1006,1007,1009], 
           'City':['mumbai','Bangalore','delhi','chennai', 'mumbai'], 
           'storeNumber': [10,23,15,17,11],
           'sales(INR)': [123,543,220,190,269],
           'Customer age': [30,40,30,45,28],
           'Gender': ['m','m','f','f','f']}
purchases = pd.DataFrame(rawData)
print(purchases)

   custID       City  storeNumber  sales(INR)  Customer age Gender
0    1001     mumbai           10         123            30      m
1    1003  Bangalore           23         543            40      m
2    1006      delhi           15         220            30      f
3    1007    chennai           17         190            45      f
4    1009     mumbai           11         269            28      f

In [42]:
# display the records of male custumers 
print(purchases['Gender'] == 'm')

purchases[purchases['Gender'] == 'm']

0     True
1     True
2    False
3    False
4    False
Name: Gender, dtype: bool

   custID       City  storeNumber  sales(INR)  Customer age Gender
0    1001     mumbai           10         123            30      m
1    1003  Bangalore           23         543            40      m

In [45]:
cities = ['Bangalore', 'mumbai']
print(purchases.City.isin(cities))
purchases[purchases.City.isin(cities)]

0     True
1     True
2    False
3    False
4     True
Name: City, dtype: bool

   custID       City  storeNumber  sales(INR)  Customer age Gender
0    1001     mumbai           10         123            30      m
1    1003  Bangalore           23         543            40      m
4    1009     mumbai           11         269            28      f

In [26]:
import pandas as pd

# Example DataFrame
data = {
    'A': [1, 2, 3],
    'B': [10, 20, 30],
    'C': [100, 200, 300]
}

df = pd.DataFrame(data)
print("Before update:")
print(df)

# Updating columns 'B' and 'C'
df['B'] = [15, 25, 35]
df['C'] = [150, 250, 350]

print("\nAfter update:")
print(df)

Before update:
   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300

After update:
   A   B    C
0  1  15  150
1  2  25  250
2  3  35  350

In [29]:
# Example using loc to update columns
print(df.loc[:, ['B', 'C']])
print(df)

    B    C
0  15  150
1  25  250
2  35  350
   A   B    C
0  1  15  150
1  2  25  250
2  3  35  350